---
kind: type
id: T:Autodesk.Revit.UI.ComboBoxData
source: html/329d158d-9589-871d-c86d-513a9e5a6526.htm
---
# Autodesk.Revit.UI.ComboBoxData

This class contains information necessary to construct a combo box in the Ribbon.

## Syntax (C#)
```csharp
public class ComboBoxData : RibbonItemData
```